{
  "common": {
    "alert": {
      "danger": "Danger!",
      "info": "Info!",
      "success": "Success!",
      "warning": "Warning!"
    },
    "form": {
      "first_name": {
        "invalid_feedback": "Must be between 3 and 20 characters and start with a capital letter!",
        "label": "First Name"
      },
      "last_name": {
        "invalid_feedback": "Must be between 3 and 20 characters and start with a capital letter!",
        "label": "Last Name"
      },
      "loading": "Finish...",
      "search": "Search",
      "submit": "Submit",
      "valid_feedback": "Looks good!"
    },
    "guest": {
      "anonym": "Anonymous"
    },
    "loading": "Loading...",
    "modal": {
      "close": "Close",
      "understood": "Understood!",
      "warning": "Attention!"
    },
    "table": {
      "total": "Total"
    },
    "theme": {
      "auto": "Auto",
      "dark": "Dark",
      "light": "Light"
    }
  },
  "guests": {
    "count": {
      "post": "are in!",
      "pre": "Already"
    },
    "title": "Guestlist"
  },
  "home": {
    "details": {
      "intro": "Read also more information about the party in the ",
      "link": "details"
    },
    "join": {
      "button": "JOIN NOW!",
      "title": "Register now!"
    },
    "shift": {
      "button": "Your Shift!"
    },
    "title": "What awaits you?"
  },
  "join": {
    "subtitle": "This automatically puts you on the guest list and you're in!",
    "success": "You have successfully registered and logged in!<br><br>Note: To log in in other browsers or devices, copy a login link via the button below!",
    "title": "Sign up!"
  },
  "nav": {
    "admin": "Admin",
    "details": "Details",
    "guests": "Guests",
    "history": "History",
    "home": "Home",
    "join": "JOIN!",
    "lang": {
      "de": "🇩🇪 German",
      "en": "🇬🇧 English"
    },
    "logout": "Logout",
    "privacy": "Privacy",
    "profile": "Profile",
    "shiftings": "Shifts"
  },
  "privacy": {
    "imprint": {
      "contact": "Contact",
      "declaration": "Information according to § 5 TMG",
      "email": "E-Mail",
      "phone": "Phone",
      "title": "Imprint"
    },
    "privacy": {
      "access": {
        "body": "Only the above-mentioned operator of this website has access to all data. The respective given name is publicly viewable, if not set anonym! If a user account is deleted, all data associated with this account will also be deleted. This also includes the set shifts and options.",
        "title": "Who has access to my data and why?"
      },
      "cookies": {
        "body": "This website does not use analytical tracking of any kind. This website uses cookies. These are small text files that the web browser stores on the end device. Cookies help to make the website more user-friendly, effective, and secure. Some cookies are \"session cookies.\" Such cookies are deleted by themselves at the end of the browser session. In contrast, other cookies remain on your terminal device until they are manually deleted by yourself. Such cookies help to reuse settings made when returning to the website. Remember the Word Disco. With a modern web browser, the setting of cookies can be monitored, restricted, or prevented. Many web browsers can be configured to automatically delete cookies when the program is closed. Disabling cookies may result in limited functionality of the website.",
        "title": "Analytics/Cookies/External Resources etc.?"
      },
      "registration": {
        "body": "If \"Confirm\" is clicked during registration, all information provided here will be sent to a database on a dedicated server of IONOS SE in Frankfurt, Germany and stored there at the latest until the end of the operation of this website.",
        "title": "What happens to the information I provide during registration?"
      },
      "rights": {
        "body": "According to DSGVO and BDSG, you can request information, updating, blocking or deletion of all your data at any time. Your contact person for this is the above-mentioned operator of this website. In addition, I am obliged to remind you of your right to object to this consent at any time and, if necessary, to complain to a supervisory authority about me.",
        "title": "What are my rights?"
      },
      "title": "Privacy"
    }
  },
  "profile": {
    "button": {
      "login_link": "Copy login link",
      "profile": "Edit profile"
    },
    "copied": "Login link was copied to the clipboard!",
    "form": {
      "delete_account": {
        "desc": "Attention: Herewith you log out of the event! All user data will be irretrievably lost."
      }
    },
    "header": "Profile",
    "option": {
      "anonym": "I do not want to be listed in the public guest list",
      "delete_account": "Delete account",
      "get_user_data": "Get all user data",
      "title": "Options"
    }
  },
  "shifts": {
    "choose": {
      "please_log_in": "You must be logged in or registered for this!",
      "title": "Choose your shift!",
      "want_help": "You want to help me with my birthday? Very good! Then sign up for a shift here! You will receive a message with more detailed instructions shortly before the event."
    },
    "table": {
      "free": "Not occupied",
      "info": "Info",
      "stand": "Stand",
      "take_slot": "Take",
      "time": "Time",
      "used_spots": "Occupied"
    },
    "title": "Shifts"
  }
}